In [2]:
import pandas as pd
import sqlite3

# Tạo bảng Student và course :

In [3]:
# Kết nối đến tệp database : 
conn = sqlite3.connect("student_course.db")
cursor = conn.cursor()

In [4]:
# Tạo bảng student
cursor.execute('''
    CREATE TABLE student (
        student_id INTEGER PRIMARY KEY,
        name Varchar(50),
        class VARCHAR(50),
        course_id INTEGER,
        score FLOAT
    )
''')

# Chèn dữ liệu vào bảng student
students = [
    (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
    (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
    (3, 'Pham Van Nam', 'Toan Tin', None, 7.9),
    (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
    (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0),
    (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5),
    (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
    (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
    (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2),
    (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)
]
cursor.executemany("INSERT INTO student VALUES (?, ?, ?, ?, ?)", students)

# Tạo bảng course
cursor.execute('''
    CREATE TABLE course (
        id INTEGER PRIMARY KEY,
        course_name VARCHAR(50)
    )
''')

# Chèn dữ liệu vào bảng course
courses = [
    (12, 'Giai tich'),
    (34, 'Thong ke'),
    (26, 'Tin hoc')
]
cursor.executemany("INSERT INTO course VALUES (?, ?)", courses)

# Lưu thay đổi
conn.commit()
print("Dữ liệu đã được khởi tạo thành công!")

Dữ liệu đã được khởi tạo thành công!

1. Hãy kết nối hai bảng trên theo những cách sau:
- Sử dụng tích Decartes.
- Sử dụng JOIN: INNER JOIN, LEFT JOIN, RIGHT JOIN, FULL OUTER JOIN

In [5]:
#Sử dụng tích Descartes 
cursor.execute('''
    SELECT * FROM student,course
''')
print("\nTích Descartes:")
cursor.fetchall()

Tích Descartes:

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc'),
 (1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong ke'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai tich'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong ke'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai tich'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc'),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong ke'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 12, 'Giai tich'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 26, 'Tin hoc'),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, 34, 'Thong ke'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai tich'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin hoc'),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai tich'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai tich'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong ke'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai tich'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin hoc'),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong ke'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai tich'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc'),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong ke')]

* Sử dụng JOIN :

In [6]:
# INNER JOIN
cursor.execute('''
    SELECT *
    FROM student JOIN course ON student.course_id = course.id
''')
print("\nINNER JOIN:")
cursor.fetchall()

INNER JOIN:

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke')]

In [7]:
# LEFT JOIN
cursor.execute('''
    SELECT *
    FROM student LEFT JOIN course ON student.course_id = course.id
''')
print("\nLEFT JOIN:")
cursor.fetchall()

LEFT JOIN:

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)]

In [8]:
# RIGHT JOIN 
cursor.execute('''
    SELECT *
    FROM student RIGHT JOIN course ON student.course_id = course.id
''')
print("\nRIGHT JOIN:")
cursor.fetchall()

RIGHT JOIN:

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (None, None, None, None, None, 26, 'Tin hoc')]

In [9]:
# FULL OUTER JOIN 
cursor.execute('''
    SELECT *
    FROM student 
    FULL OUTER JOIN course ON student.course_id = course.id

''')
print("\nFULL OUTER JOIN:")
cursor.fetchall()

FULL OUTER JOIN:

[(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai tich'),
 (2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None),
 (4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None),
 (5, 'Vu Quoc Anh', 'May Tinh', 24, 8.0, None, None),
 (6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None),
 (7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong ke'),
 (8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None),
 (9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None),
 (10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None),
 (None, None, None, None, None, 26, 'Tin hoc')]

2. Hãy cập nhật những giá trị course_id còn thiếu trong bảng student bằng câu lệnh SQL, trong đó các giá trị được điền là những giá trị nằm trong bảng course và loại bỏ những bản ghi tham gia những môn học không tồn tại bảng course. Sau đó hãy cho biết:

a. Tổng số sinh viên, điểm trung bình của từng lớp.

b. Tổng số sinh viên, điểm trung bình của từng môn học.

c. Phân loại thi đua theo số điểm của từng môn học biết:
i. Điểm TB ≥ 9.0: Xuất sắc.
ii. 6.0 ≤ Điểm TB ≤ 8.9: Tốt.
iii. Điểm TB < 6.0: Kém.

In [10]:
# Cập nhật course_id còn thiếu bằng cách lấy một giá trị hợp lệ từ bảng course
cursor.execute('''
    UPDATE student
    SET course_id = (SELECT id FROM course ORDER BY RANDOM() LIMIT 1)
    WHERE student_id IN (SELECT student_id FROM student WHERE course_id IS NULL ORDER BY RANDOM());
''')
conn.commit()
# Hiển thị dữ liệu sau khi cập nhật
cursor.execute("SELECT * FROM student")
print("\nDữ liệu sau khi cập nhật course_id:")
df_updated = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'class', 'course_id', 'score'])
print(df_updated)

Dữ liệu sau khi cập nhật course_id:
   student_id               name     class  course_id  score
0           1  Nguyen Minh Hoang  May Tinh         12    6.7
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           3       Pham Van Nam  Toan Tin         12    7.9
3           4     Le Thanh Huyen  Toan Tin         20    7.2
4           5        Vu Quoc Anh  May Tinh         24    8.0
5           6     Dang Thuy Linh  May Tinh         24    5.5
6           7      Bui Tien Dung   Kinh Te         34    9.2
7           8        Ho Ngoc Mai  Toan Tin         20    8.8
8           9     Duong Huu Phuc   Kinh Te         12    7.2
9          10       Cao Thi Hanh  May Tinh         12    7.0

In [11]:
# Xóa các bản ghi có course_id không tồn tại trong bảng course
cursor.execute('''
    DELETE FROM student
    WHERE course_id NOT IN (SELECT id FROM course)
''')
conn.commit()

# Hiển thị dữ liệu sau khi xóa
cursor.execute("SELECT * FROM student")
print("\nDữ liệu sau khi xóa các bản ghi không hợp lệ:")
df_cleaned = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'class', 'course_id', 'score'])
print(df_cleaned)

Dữ liệu sau khi xóa các bản ghi không hợp lệ:
   student_id               name     class  course_id  score
0           1  Nguyen Minh Hoang  May Tinh         12    6.7
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           3       Pham Van Nam  Toan Tin         12    7.9
3           7      Bui Tien Dung   Kinh Te         34    9.2
4           9     Duong Huu Phuc   Kinh Te         12    7.2
5          10       Cao Thi Hanh  May Tinh         12    7.0

In [12]:
#a. Tính tổng số sinh viên và điểm trung bình theo lớp học
cursor.execute('''
    SELECT class, COUNT(*) AS total_students, AVG(score) AS avg_score
    FROM student
    GROUP BY class
''')
print("\nTổng số sinh viên và điểm trung bình theo lớp:")
df_class_stats = pd.DataFrame(cursor.fetchall(), columns=['class', 'total_students', 'avg_score'])
print(df_class_stats)

Tổng số sinh viên và điểm trung bình theo lớp:
      class  total_students  avg_score
0   Kinh Te               3   8.533333
1  May Tinh               2   6.850000
2  Toan Tin               1   7.900000

In [13]:
#b. Tính tổng số sinh viên và điểm trung bình theo môn học
cursor.execute('''
    SELECT course.course_name, COUNT(student.student_id) AS total_students, AVG(student.score) AS avg_score
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name
''')
print("\nTổng số sinh viên và điểm trung bình theo môn học:")
df_course_stats = pd.DataFrame(cursor.fetchall(), columns=['course_name', 'total_students', 'avg_score'])
print(df_course_stats)

Tổng số sinh viên và điểm trung bình theo môn học:
  course_name  total_students  avg_score
0   Giai tich               4        7.2
1    Thong ke               2        9.2

In [14]:
#c. Phân loại thi đua theo điểm trung bình của môn học 
cursor.execute('''
    SELECT course.course_name, 
           CASE 
               WHEN AVG(student.score) >= 9.0 THEN 'Xuất sắc'
               WHEN AVG(student.score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
               ELSE 'Kém'
           END AS classification
    FROM student
    JOIN course ON student.course_id = course.id
    GROUP BY course.course_name
''')
print("\nPhân loại thi đua theo điểm trung bình của môn học:")
df_ranking = pd.DataFrame(cursor.fetchall(), columns=['course_name', 'classification'])
print(df_ranking)

Phân loại thi đua theo điểm trung bình của môn học:
  course_name classification
0   Giai tich            Tốt
1    Thong ke       Xuất sắc

3. Hãy xếp hạng sinh viên thông qua:

a. Điểm số.

b. Điểm số theo lớp học.

c. Điểm số theo mã môn học.

In [15]:
#Xếp hạng sinh viên theo điểm số : Sử dụng hàm RANK() OVER() để xếp hạng sinh viên theo điểm số, lớp học, và mã môn học.

cursor.execute('''
    SELECT student_id, name, score, 
           RANK() OVER (ORDER BY score DESC) as rank_overall
    FROM student
''')
df_rank_overall = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'score', 'rank_overall'])
print(df_rank_overall)

   student_id               name  score  rank_overall
0           2       Tran Thi Lan    9.2             1
1           7      Bui Tien Dung    9.2             1
2           3       Pham Van Nam    7.9             3
3           9     Duong Huu Phuc    7.2             4
4          10       Cao Thi Hanh    7.0             5
5           1  Nguyen Minh Hoang    6.7             6

In [16]:
# Top 3 cao nhất/thấp nhất 
cursor.execute('''
    SELECT student_id, name, score
    FROM (
        SELECT student_id, name, score, RANK() OVER (ORDER BY score DESC) as rank_score
        FROM student
    )
    WHERE rank_score <= 3
''')
top3_score = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'score'])

cursor.execute('''
    SELECT student_id, name, score
    FROM (
        SELECT student_id, name, score, RANK() OVER (ORDER BY score ASC) as rank_score
        FROM student
    )
    WHERE rank_score <= 3
''')
bottom3_score = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'score'])

print("\nTop 3 sinh viên có điểm cao nhất:")
print(top3_score)
print("\nTop 3 sinh viên có điểm thấp nhất:")
print(bottom3_score)

Top 3 sinh viên có điểm cao nhất:
   student_id           name  score
0           2   Tran Thi Lan    9.2
1           7  Bui Tien Dung    9.2
2           3   Pham Van Nam    7.9

Top 3 sinh viên có điểm thấp nhất:
   student_id               name  score
0           1  Nguyen Minh Hoang    6.7
1          10       Cao Thi Hanh    7.0
2           9     Duong Huu Phuc    7.2

In [17]:
# b. Điểm số theo lớp học : 

cursor.execute('''
    SELECT student_id, name, class, score, RANK() OVER (PARTITION BY class ORDER BY score DESC) as rank_class
    FROM student
''')
df_rank_class = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'class', 'score', 'rank_class'])

print("\nXếp hạng theo điểm số trong lớp học:")
print(df_rank_class)

Xếp hạng theo điểm số trong lớp học:
   student_id               name     class  score  rank_class
0           2       Tran Thi Lan   Kinh Te    9.2           1
1           7      Bui Tien Dung   Kinh Te    9.2           1
2           9     Duong Huu Phuc   Kinh Te    7.2           3
3          10       Cao Thi Hanh  May Tinh    7.0           1
4           1  Nguyen Minh Hoang  May Tinh    6.7           2
5           3       Pham Van Nam  Toan Tin    7.9           1

In [18]:
cursor.execute('''
    SELECT student_id, name, class, score
    FROM (
        SELECT student_id, name, class, score, RANK() OVER (PARTITION BY class ORDER BY score DESC) as rank_class
        FROM student
    )
    WHERE rank_class <= 3
''')
top3_class = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'class', 'score'])

cursor.execute('''
    SELECT student_id, name, class, score
    FROM (
        SELECT student_id, name, class, score, RANK() OVER (PARTITION BY class ORDER BY score ASC) as rank_class
        FROM student
    )
    WHERE rank_class <= 3
''')
bottom3_class = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'class', 'score'])

print("\nTop 3 sinh viên có điểm cao nhất trong mỗi lớp:")
print(top3_class)
print("\nTop 3 sinh viên có điểm thấp nhất trong mỗi lớp:")
print(bottom3_class)

Top 3 sinh viên có điểm cao nhất trong mỗi lớp:
   student_id               name     class  score
0           2       Tran Thi Lan   Kinh Te    9.2
1           7      Bui Tien Dung   Kinh Te    9.2
2           9     Duong Huu Phuc   Kinh Te    7.2
3          10       Cao Thi Hanh  May Tinh    7.0
4           1  Nguyen Minh Hoang  May Tinh    6.7
5           3       Pham Van Nam  Toan Tin    7.9

Top 3 sinh viên có điểm thấp nhất trong mỗi lớp:
   student_id               name     class  score
0           9     Duong Huu Phuc   Kinh Te    7.2
1           2       Tran Thi Lan   Kinh Te    9.2
2           7      Bui Tien Dung   Kinh Te    9.2
3           1  Nguyen Minh Hoang  May Tinh    6.7
4          10       Cao Thi Hanh  May Tinh    7.0
5           3       Pham Van Nam  Toan Tin    7.9

In [19]:
#3. Điểm số theo mã môn học
cursor.execute('''
    SELECT student_id, name, course_id, score, RANK() OVER (PARTITION BY course_id ORDER BY score DESC) as rank_course
    FROM student
''')
df_rank_course = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'course_id', 'score', 'rank_course'])

print("\nXếp hạng theo điểm số trong mã môn học:")
print(df_rank_course)

Xếp hạng theo điểm số trong mã môn học:
   student_id               name  course_id  score  rank_course
0           3       Pham Van Nam         12    7.9            1
1           9     Duong Huu Phuc         12    7.2            2
2          10       Cao Thi Hanh         12    7.0            3
3           1  Nguyen Minh Hoang         12    6.7            4
4           2       Tran Thi Lan         34    9.2            1
5           7      Bui Tien Dung         34    9.2            1

In [20]:
cursor.execute('''
    SELECT student_id, name, course_id, score
    FROM (
        SELECT student_id, name, course_id, score, RANK() OVER (PARTITION BY course_id ORDER BY score DESC) as rank_class
        FROM student
    )
    WHERE rank_class <= 3
''')
top3_course_id = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'course_id', 'score'])

cursor.execute('''
    SELECT student_id, name,course_id, score
    FROM (
        SELECT student_id, name, course_id, score, RANK() OVER (PARTITION BY course_id ORDER BY score ASC) as rank_class
        FROM student
    )
    WHERE rank_class <= 3
''')
bottom3_course_id = pd.DataFrame(cursor.fetchall(), columns=['student_id', 'name', 'course_id', 'score'])

print("\nTop 3 sinh viên có điểm cao nhất theo mã môn học:")
print(top3_course_id)
print("\nTop 3 sinh viên có điểm thấp nhất theo mã môn học:")
print(bottom3_course_id)

Top 3 sinh viên có điểm cao nhất theo mã môn học:
   student_id            name  course_id  score
0           3    Pham Van Nam         12    7.9
1           9  Duong Huu Phuc         12    7.2
2          10    Cao Thi Hanh         12    7.0
3           2    Tran Thi Lan         34    9.2
4           7   Bui Tien Dung         34    9.2

Top 3 sinh viên có điểm thấp nhất theo mã môn học:
   student_id               name  course_id  score
0           1  Nguyen Minh Hoang         12    6.7
1          10       Cao Thi Hanh         12    7.0
2           9     Duong Huu Phuc         12    7.2
3           2       Tran Thi Lan         34    9.2
4           7      Bui Tien Dung         34    9.2

# 4. Bổ sung thêm một trường graduation_date có kiểu dữ liệu là DATETIME vào bảng student để xác định thời gian tốt nghiệp của từng bạn, trong đó thời gian tốt nghiệp được xác định bởi thời gian hiện tại cộng với số hạng tương ứng của bạn đó tính theo điểm số.

In [4]:
# Kết nối đến database
conn = sqlite3.connect("student_course.db") 
cursor = conn.cursor()

# Cập nhật graduation_date dựa trên thứ hạng điểm số
cursor.execute('''
    WITH ranked_students AS (
        SELECT student_id, RANK() OVER (ORDER BY score DESC) AS rank_score
        FROM student
    )
    UPDATE student
    SET graduation_date = datetime('now', '+' || (SELECT rank_score FROM ranked_students WHERE ranked_students.student_id = student.student_id) || ' days')
''')

# Xác nhận thay đổi
conn.commit()

# Kiểm tra kết quả
cursor.execute("SELECT * FROM student")
students = cursor.fetchall()

# Đóng kết nối
conn.close()

# In kết quả để kiểm tra
for student in students:
    print(student)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, '2025-03-20 14:48:32')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, '2025-03-15 14:48:32')
(3, 'Pham Van Nam', 'Toan Tin', 12, 7.9, '2025-03-17 14:48:32')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, '2025-03-15 14:48:32')
(9, 'Duong Huu Phuc', 'Kinh Te', 12, 7.2, '2025-03-18 14:48:32')
(10, 'Cao Thi Hanh', 'May Tinh', 12, 7.0, '2025-03-19 14:48:32')